Revit 2026 API

# GeomCombinationSetErase Method

---

Removes a specified GeomCombination from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	GeomCombination item
)
```
```vb
Public Overridable Function Erase (
	item As GeomCombination
) As Integer
```
```cpp
public:
virtual int Erase(
	GeomCombination^ item
)
```
```fsharp
abstract Erase :
        item : GeomCombination -> int
override Erase :
        item : GeomCombination -> int
```

#### Parameters

item GeomCombination
    The GeomCombination to be erased.

#### Return Value

Int32The number of GeomCombinations that were erased from the set.

#### Reference

GeomCombinationSet Class

Autodesk.Revit.DB Namespace